In [25]:
import numpy as np
import pandas as pd

In [26]:
from numpy.random import randn

In [40]:
randn(3,3)

array([[-0.87431477, -1.89291495, -2.72893474],
       [ 1.50304018, -0.27852996, -1.70199763],
       [-0.28024782,  0.65570034,  0.36705599]])

In [50]:
df = pd.DataFrame(data = randn(3,3),index = ["A","B","C"],columns = ["Column1","Column2","Column3"])

In [51]:
df.loc["A"]

Column1    0.579878
Column2   -0.347008
Column3   -0.860829
Name: A, dtype: float64

In [54]:
df[["Column1","Column2"]]

    Column1   Column2
A  0.579878 -0.347008
B  1.126189  0.087825
C  0.883347 -0.015110

In [55]:
df

    Column1   Column2   Column3
A  0.579878 -0.347008 -0.860829
B  1.126189  0.087825  3.737284
C  0.883347 -0.015110  0.611092

In [63]:
df["Column4"] = pd.Series(randn(3),["A","B","C"])

In [64]:
df

    Column1   Column2   Column3   Column4
A  0.579878 -0.347008 -0.860829  1.057735
B  1.126189  0.087825  3.737284 -0.563526
C  0.883347 -0.015110  0.611092  0.904008

In [70]:
df["Column5"] = df["Column1"] + df["Column2"] + df["Column3"]

In [71]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.579878 -0.347008 -0.860829  1.057735 -0.627958
B  1.126189  0.087825  3.737284 -0.563526  4.951299
C  0.883347 -0.015110  0.611092  0.904008  1.479328

In [72]:
df

    Column1   Column2   Column3   Column4   Column5
A  0.579878 -0.347008 -0.860829  1.057735 -0.627958
B  1.126189  0.087825  3.737284 -0.563526  4.951299
C  0.883347 -0.015110  0.611092  0.904008  1.479328

In [76]:
df.drop("Column5",axis = 1 ,inplace = True)

In [77]:
df

    Column1   Column2   Column3   Column4
A  0.579878 -0.347008 -0.860829  1.057735
B  1.126189  0.087825  3.737284 -0.563526
C  0.883347 -0.015110  0.611092  0.904008

In [78]:
df["Column1"]

A    0.579878
B    1.126189
C    0.883347
Name: Column1, dtype: float64

In [79]:
df.loc["A"]

Column1    0.579878
Column2   -0.347008
Column3   -0.860829
Column4    1.057735
Name: A, dtype: float64

In [80]:
df.iloc[0]

Column1    0.579878
Column2   -0.347008
Column3   -0.860829
Column4    1.057735
Name: A, dtype: float64

In [81]:
df.loc["A","Column1"]

0.5798782883407666

In [82]:
df.loc[["A","B"],["Column1","Column2"]]

    Column1   Column2
A  0.579878 -0.347008
B  1.126189  0.087825